package me.zhoudongyu.core.consts;

/**
 * 课程性质枚举类
 */

public enum CourseProperty {
    空(""),
    公共选修课("01"),
    专业必修课("02"),
    通选课("03"),
    专业通选课("04"),
    学科基础课("05"),
    实践环节("06"),
    专业基础课("07"),
    必修课("08"),
    专业方向必修课("09"),
    实践教学("10"),
    公共基础课("11"),
    学科必修课("12"),
    全院必修课("13"),
    学科基础必修课("14"),
    辅修课("15"),
    大学外语教育课("16"),
    通识教育必修课("17"),
    英语教育课("18"),
    通识教育选修课("19"),
    大学外语教育必修课("20");


    public String desc;

    CourseProperty(String desc) {
        this.desc = desc;
    }
}
